{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "greeting",
    "1": "goodbye",
    "2": "creator",
    "3": "name",
    "4": "hours",
    "5": "number",
    "6": "course",
    "7": "fees",
    "8": "location",
    "9": "hostel",
    "10": "event",
    "11": "document",
    "12": "floors",
    "13": "syllabus",
    "14": "library",
    "15": "infrastructure",
    "16": "canteen",
    "17": "menu",
    "18": "placement",
    "19": "ithod",
    "20": "computerhod",
    "21": "extchod",
    "22": "principal",
    "23": "sem",
    "24": "admission",
    "25": "scholarship",
    "26": "facilities",
    "27": "college intake",
    "28": "uniform",
    "29": "committee",
    "30": "random",
    "31": "swear",
    "32": "vacation",
    "33": "sports",
    "34": "salutaion",
    "35": "task",
    "36": "ragging",
    "37": "hod",
    "38": "order_status",
    "39": "payment_issue",
    "40": "delivery_time",
    "41": "product_availability",
    "42": "return_policy",
    "43": "discount_offer",
    "44": "product_comparison",
    "45": "refund_process",
    "46": "subscription_cancelation",
    "47": "shipping_cost",
    "48": "technical_support",
    "49": "account_management",
    "50": "product_recommendations",
    "51": "order_modification",
    "52": "product_returns",
    "53": "product_information",
    "54": "billing_inquiries",
    "55": "customer_feedback",
    "56": "technical_specifications",
    "57": "order_tracking"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "account_management": 49,
    "admission": 24,
    "billing_inquiries": 54,
    "canteen": 16,
    "college intake": 27,
    "committee": 29,
    "computerhod": 20,
    "course": 6,
    "creator": 2,
    "customer_feedback": 55,
    "delivery_time": 40,
    "discount_offer": 43,
    "document": 11,
    "event": 10,
    "extchod": 21,
    "facilities": 26,
    "fees": 7,
    "floors": 12,
    "goodbye": 1,
    "greeting": 0,
    "hod": 37,
    "hostel": 9,
    "hours": 4,
    "infrastructure": 15,
    "ithod": 19,
    "library": 14,
    "location": 8,
    "menu": 17,
    "name": 3,
    "number": 5,
    "order_modification": 51,
    "order_status": 38,
    "order_tracking": 57,
    "payment_issue": 39,
    "placement": 18,
    "principal": 22,
    "product_availability": 41,
    "product_comparison": 44,
    "product_information": 53,
    "product_recommendations": 50,
    "product_returns": 52,
    "ragging": 36,
    "random": 30,
    "refund_process": 45,
    "return_policy": 42,
    "salutaion": 34,
    "scholarship": 25,
    "sem": 23,
    "shipping_cost": 47,
    "sports": 33,
    "subscription_cancelation": 46,
    "swear": 31,
    "syllabus": 13,
    "task": 35,
    "technical_specifications": 56,
    "technical_support": 48,
    "uniform": 28,
    "vacation": 32
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.41.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
